NAME = webserver

SRC_MAIN = $(addprefix srcs/main/, main.cpp)
SRC = $(SRC_MAIN)
OBJ = $(SRC:.cpp=.o)

CXX = c++
CXXFLAGS = -Wall -Wextra -Werror -std=c++98 -I include 

GREEN = \033[1;32m
YELLOW = \033[1;33m
BLUE = \033[1;34m
RED = \033[1;31m
CYAN = \033[1;36m
PURPLE = \033[1;35m
RESET = \033[0m

all: $(NAME)

%.o: %.cpp
	@echo "$(CYAN)[Compiling]$(RESET) $<"
	@$(CXX) $(CXXFLAGS) -c $< -o $@

$(NAME): $(OBJ)
	@echo "$(YELLOW)🔧 Linking WebServer...$(RESET)"
	@$(CXX) $(CXXFLAGS) $(OBJ) -o $(NAME)
	@echo "$(GREEN)Build complete: ./$(NAME)$(RESET)"
	@echo "$(BLUE)------------------------------------------------------------------------------$(RESET)"
	@echo "$(BLUE)░██╗░░░░░░░██╗███████╗██████╗░░██████╗███████╗██████╗░██╗░░░██╗███████╗██████╗░$(RESET)"
	@echo "$(BLUE)░██║░░██╗░░██║██╔════╝██╔══██╗██╔════╝██╔════╝██╔══██╗██║░░░██║██╔════╝██╔══██╗$(RESET)"
	@echo "$(BLUE)░╚██╗████╗██╔╝█████╗░░██████╦╝╚█████╗░█████╗░░██████╔╝╚██╗░██╔╝█████╗░░██████╔╝$(RESET)"
	@echo "$(BLUE)░░████╔═████║░██╔══╝░░██╔══██╗░╚═══██╗██╔══╝░░██╔══██╗░╚████╔╝░██╔══╝░░██╔══██╗$(RESET)"
	@echo "$(BLUE)░░╚██╔╝░╚██╔╝░███████╗██████╦╝██████╔╝███████╗██║░░██║░░╚██╔╝░░███████╗██║░░██║$(RESET)"
	@echo "$(BLUE)░░░╚═╝░░░╚═╝░░╚══════╝╚═════╝░╚═════╝░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚══════╝╚═╝░░╚═╝$(RESET)"
	@echo "$(RED)                       🔥 MADE BY: Arseniy & Hakob 🔥		 $(RESET)"
	@echo "$(BLUE)-------------------------------------------------------------------------------$(RESET)"

clean:
	@rm -f $(OBJ)
	@echo "$(RED)🧹 Object files removed!$(RESET)"

fclean: clean
	@rm -f $(NAME)
	@echo "$(RED)🔥 Executable removed: $(NAME)$(RESET)"

re: fclean all

.PHONY: all clean fclean re
